Infineon/mtb-example-psoc4-msclp-capsense-low-power/main.c
/******************************************************************************
* File Name:   main.c
*
* Description: This is the source code for the PSoC 4: MSCLP CAPSENSE Low Power
*              Example for ModusToolbox.
*
* Related Document: See README.md
*
*
*******************************************************************************
* $ Copyright 2021-2022 Cypress Semiconductor $
*******************************************************************************/

/*******************************************************************************
 * Include header files
 ******************************************************************************/

#include "cy_pdl.h"
#include "cybsp.h"
#include "cycfg.h"
#include "cycfg_capsense.h"
#include "SpiMaster.h"
#include "LEDcontrol.h"

/*******************************************************************************
* User configurable Macros
********************************************************************************/

/* Enable this, if Serial LED needs to be enabled */
#define ENABLE_SPI_SERIAL_LED            (1u)

/* Enable this, if Tuner needs to be enabled */
#define ENABLE_TUNER                     (1u)

/* Enable this, if Debugging needs to be enabled -
 *    See Readme for more details.
 *    SWD and Tuner cannot be enabled together as the pins are MUXed in CY8CKIT-040T */
#define SWD_DEBUG_ENABLE                 (0u)

/* 128Hz Refresh rate in Active mode */
#define ACTIVE_MODE_REFRESH_RATE         (128u)

/* 32Hz Refresh rate in Active-Low Refresh rate(ALR) mode */
#define ALR_MODE_REFRESH_RATE            (32u)

/* Timeout to move from ACTIVE mode to ALR mode if there is no user activity */
#define ACTIVE_MODE_TIMEOUT_SEC          (10u)

/* Timeout to move from ALR mode to WOT mode if there is no user activity */
#define ALR_MODE_TIMEOUT_SEC             (5u)

/* Scan time in ms ~=0.1ms */
#define ACTIVE_MODE_FRAME_SCAN_TIME      (0u)

/* Scan time in ms ~=0.1ms */
#define ALR_MODE_FRAME_SCAN_TIME         (0u)

/* Measured ILO frequency */
#define MEASURED_ILO                     (40u)

/*******************************************************************************
* Macros
********************************************************************************/
#define CAPSENSE_MSC0_INTR_PRIORITY      (3u)
#define CY_ASSERT_FAILED                 (0u)

/* Setting SWD_DEBUG_ENABLE to 0 enabled EZI2C */
#define ENABLE_EZI2C                     (!SWD_DEBUG_ENABLE & ENABLE_TUNER)

#if ENABLE_EZI2C
/* EZI2C interrupt priority must be higher than CAPSENSE interrupt. */
#define EZI2C_INTR_PRIORITY              (2u)
#endif

#define TIME_IN_MS                       (1000u)

/* Expected ILO frequency */
#define EXPECTED_ILO                     (40u)

/* 128Hz Refresh rate in Active mode */
#define ACTIVE_MODE_REFRESH_RATE_CORRECTED    (ACTIVE_MODE_REFRESH_RATE * EXPECTED_ILO / MEASURED_ILO)
/* 32Hz Refresh rate in Active-Low Refresh rate(ALR) mode */
#define ALR_MODE_REFRESH_RATE_CORRECTED  (ALR_MODE_REFRESH_RATE * EXPECTED_ILO / MEASURED_ILO )

#if ((TIME_IN_MS / ACTIVE_MODE_REFRESH_RATE) > ACTIVE_MODE_FRAME_SCAN_TIME)
    #define ACTIVE_MODE_TIMER            (TIME_IN_MS / ACTIVE_MODE_REFRESH_RATE_CORRECTED - ACTIVE_MODE_FRAME_SCAN_TIME)
#elif
    #define ACTIVE_MODE_TIMER            (0u)
#endif

#if ((TIME_IN_MS / ALR_MODE_REFRESH_RATE) > ALR_MODE_FRAME_SCAN_TIME)
    #define ALR_MODE_TIMER               (TIME_IN_MS / ALR_MODE_REFRESH_RATE_CORRECTED - ALR_MODE_FRAME_SCAN_TIME)
#elif
    #define ALR_MODE_TIMER               (0u)
#endif

#define ACTIVE_MODE_TIMEOUT              (ACTIVE_MODE_REFRESH_RATE_CORRECTED * ACTIVE_MODE_TIMEOUT_SEC)

#define ALR_MODE_TIMEOUT                 (ALR_MODE_REFRESH_RATE_CORRECTED * ALR_MODE_TIMEOUT_SEC)


/*****************************************************************************
* Finite state machine states for device operating states
*****************************************************************************/
typedef enum
{
    ACTIVE_MODE = 0x01u,    /* Active mode - All the sensors are scanned in this state
                            * with highest refresh rate */
    ALR_MODE = 0x02u,       /* Active-Low Refresh Rate (ALR) mode - All the sensors are
                            * scanned in this state with low refresh rate */
    WOT_MODE = 0x03u        /* Wake on Touch (WoT) mode - Low Power sensors are scanned
                            * in this state with lowest refresh rate */
} APPLICATION_STATE;

/*******************************************************************************
* Function Prototypes
********************************************************************************/
static void initialize_capsense(void);
static void capsense_msc0_isr(void);

#if ENABLE_EZI2C
static void ezi2c_isr(void);
static void initialize_capsense_tuner(void);
static void tuner_wrapper(void);
#endif

#if ENABLE_SPI_SERIAL_LED
void led_control();
#endif

/* Deep Sleep Callback function */
void register_callback(void);
cy_en_syspm_status_t deep_sleep_callback(cy_stc_syspm_callback_params_t *callbackParams,
                                         cy_en_syspm_callback_mode_t mode);

/*******************************************************************************
* Global Definitions
*******************************************************************************/

/* Variables holds the current low power state [ACTIVE, ALR or WOT] */
APPLICATION_STATE capsense_state;

#if ENABLE_EZI2C
cy_stc_scb_ezi2c_context_t ezi2c_context;
#endif

#if ENABLE_SPI_SERIAL_LED
extern cy_stc_scb_spi_context_t CYBSP_MASTER_SPI_context;
stc_serial_led_context_t led_context;
#endif

/* Callback parameters for custom, EzI2C, SPI */

#if ENABLE_EZI2C
/* Callback parameters for EzI2C */
cy_stc_syspm_callback_params_t ezi2cCallbackParams =
{
    .base       = SCB1,
    .context    = &ezi2c_context
};
#endif

#if ENABLE_SPI_SERIAL_LED
/* Callback parameters for SPI */
cy_stc_syspm_callback_params_t spiCallbackParams =
{
    .base       = SCB0,
    .context    = &CYBSP_MASTER_SPI_context
};
#endif

/* Callback parameters for custom callback */
cy_stc_syspm_callback_params_t deepSleepCallBackParams = {
    .base       =  NULL,
    .context    =  NULL
};

#if ENABLE_EZI2C
/* Callback declaration for EzI2C Deep Sleep callback */
cy_stc_syspm_callback_t ezi2cCallback =
{
    .callback       = (Cy_SysPmCallback)&Cy_SCB_EZI2C_DeepSleepCallback,
    .type           = CY_SYSPM_DEEPSLEEP,
    .skipMode       = 0UL,
    .callbackParams = &ezi2cCallbackParams,
    .prevItm        = NULL,
    .nextItm        = NULL,
    .order          = 0
};
#endif

#if ENABLE_SPI_SERIAL_LED
/* Callback declaration for SPI Deep Sleep callback */
cy_stc_syspm_callback_t spiCallback =
{
    .callback       = (Cy_SysPmCallback)&Cy_SCB_SPI_DeepSleepCallback,
    .type           = CY_SYSPM_DEEPSLEEP,
    .skipMode       = 0UL,
    .callbackParams = &spiCallbackParams,
    .prevItm        = NULL,
    .nextItm        = NULL,
    .order          = 1
};
#endif

/* Callback declaration for Custom Deep Sleep callback */
cy_stc_syspm_callback_t deepSleepCb =
{
    .callback       = &deep_sleep_callback,
    .type           = CY_SYSPM_DEEPSLEEP,
    .skipMode       = 0UL,
    .callbackParams = &deepSleepCallBackParams,
    .prevItm        = NULL,
    .nextItm        = NULL,
    .order          = 2
};

