Infineon/mtb-example-psoc4-msclp-capsense-low-power/main.c
/*******************************************************************************
* Function Name: main
********************************************************************************
* Summary:
*  System entrance point. This function performs
*  - initial setup of device
*  - initialize CAPSENSE
*  - initialize tuner communication
*  - scan touch input continuously at 3 different power modes
*  - serial RGB LED for touch indication
*
* Return:
*  int
*
*******************************************************************************/
int main(void)
{
    cy_rslt_t result;
    uint32_t capsense_state_timeout;

    /* Initialize the device and board peripherals */
    result = cybsp_init() ;

    /* Board init failed. Stop program execution */
    if (result != CY_RSLT_SUCCESS)
    {
        CY_ASSERT(CY_ASSERT_FAILED);
    }

    /* Enable global interrupts */
    __enable_irq();

    #if ENABLE_EZI2C
    /* Initialize EZI2C */
    initialize_capsense_tuner();
    #elif !SWD_DEBUG_ENABLE
    /* EZI2C pins drive mode to Analog HighZ */
    Cy_GPIO_SetDrivemode(CYBSP_I2C_SDA_PORT, CYBSP_I2C_SDA_PIN, CY_GPIO_DM_ANALOG);
    Cy_GPIO_SetDrivemode(CYBSP_I2C_SCL_PORT, CYBSP_I2C_SCL_PIN, CY_GPIO_DM_ANALOG);
    #endif

    /* Initialize MSC CAPSENSE */
    initialize_capsense();

    #if ENABLE_SPI_SERIAL_LED
    /* Initialize SPI master */
    result = init_spi_master();

    /* Initialization failed. Stop program execution */
    if(result != INIT_SUCCESS)
    {
        CY_ASSERT(0);
    }
    #else

    /* SPI pins drive mode to Analog HighZ */
    Cy_GPIO_SetDrivemode(CYBSP_SERIAL_LED_PORT, CYBSP_SERIAL_LED_NUM, CY_GPIO_DM_ANALOG);
    #endif

    /* Register callbacks */
    register_callback();

    /* Define initial state of the device and the corresponding refresh rate*/
    capsense_state = ACTIVE_MODE;
    capsense_state_timeout = 0u;

    /* Configure the MSCLP wake up timer as per the ACTIVE mode refresh rate */
    Cy_CapSense_ConfigureMsclpTimer(ACTIVE_MODE_TIMER, &cy_capsense_context);

    for (;;)
    {
        switch(capsense_state)
        {
            case ACTIVE_MODE:

                Cy_CapSense_ScanAllSlots(&cy_capsense_context);

                while (Cy_CapSense_IsBusy(&cy_capsense_context))
                {
                    Cy_SysPm_CpuEnterDeepSleep ();
                }

                Cy_CapSense_ProcessAllWidgets(&cy_capsense_context);

                #if ENABLE_SPI_SERIAL_LED
                /* Serial LED control for showing the CAPSENSE touch status and power mode */
                led_control();
                #endif

                #if ENABLE_EZI2C
                /* Establishes synchronized communication with the CAPSENSE Tuner tool */
                tuner_wrapper();
                #endif

                /* Scan, process and check the status of the all Active mode sensors */
                if(Cy_CapSense_IsAnyWidgetActive(&cy_capsense_context))
                {
                    capsense_state_timeout = 0u;
                }
                else
                {
                    capsense_state_timeout++;

                    if(ACTIVE_MODE_TIMEOUT < capsense_state_timeout)
                    {
                        capsense_state = ALR_MODE;
                        capsense_state_timeout = 0;

                        /* Configure the MSCLP wake up timer as per the ALR mode refresh rate */
                        Cy_CapSense_ConfigureMsclpTimer(ALR_MODE_TIMER, &cy_capsense_context);
                    }
                }

                break;
                /* End of ACTIVE_MODE */

            /* Active Low Refresh-rate Mode */
            case ALR_MODE :

                Cy_CapSense_ScanAllSlots(&cy_capsense_context);

                while (Cy_CapSense_IsBusy(&cy_capsense_context))
                {
                    Cy_SysPm_CpuEnterDeepSleep ();
                }

                Cy_CapSense_ProcessAllWidgets(&cy_capsense_context);

                #if ENABLE_SPI_SERIAL_LED
                /* Serial LED control for showing the CAPSENSE touch status and power mode */
                led_control();
                #endif

                #if ENABLE_EZI2C
                /* Establishes synchronized communication with the CAPSENSE Tuner tool */
                tuner_wrapper();
                #endif

                /* Scan, process and check the status of the all Active mode sensors */
                if(Cy_CapSense_IsAnyWidgetActive(&cy_capsense_context))
                {
                    capsense_state = ACTIVE_MODE;
                    capsense_state_timeout = 0u;

                    /* Configure the MSCLP wake up timer as per the ACTIVE mode refresh rate */
                    Cy_CapSense_ConfigureMsclpTimer(ACTIVE_MODE_TIMER, &cy_capsense_context);
                }
                else
                {
                    capsense_state_timeout++;

                    if(ALR_MODE_TIMEOUT < capsense_state_timeout)
                    {
                        capsense_state = WOT_MODE;
                        capsense_state_timeout = 0;

                        /* Disabling CIC2 filter for WOT mode sensors */
                        cy_capsense_context.ptrCommonConfig->ptrChConfig->ptrHwBase->FILTER_CTL &=
                                    (~(1uL << MSCLP_FILTER_CTL_FILTER_MODE_Pos));
                    }
                }

                break;
                /* End of Active-Low Refresh Rate(ALR) mode */

            /* Wake On Touch Mode */
            case WOT_MODE :

                Cy_CapSense_ScanAllLpSlots(&cy_capsense_context);

                #if ENABLE_SPI_SERIAL_LED
                /* Serial LED control for showing the CAPSENSE touch status and power mode */
                led_control();
                #endif

                while (Cy_CapSense_IsBusy(&cy_capsense_context))
                {
                    Cy_SysPm_CpuEnterDeepSleep ();
                }

                #if ENABLE_EZI2C
                /* Establishes synchronized communication with the CAPSENSE Tuner tool */
                tuner_wrapper();
                #endif

                if (Cy_CapSense_IsAnyLpWidgetActive(&cy_capsense_context))
                {
                    capsense_state = ACTIVE_MODE;
                    capsense_state_timeout = 0;

