Infineon/mtb-example-psoc4-msclp-capsense-low-power/main.c
                    /* Configure the MSCLP wake up timer as per the ACTIVE mode refresh rate */
                    Cy_CapSense_ConfigureMsclpTimer(ACTIVE_MODE_TIMER, &cy_capsense_context);

                    /* Enabling CIC2 filters for ACTIVE mode sensors */
                    cy_capsense_context.ptrCommonConfig->ptrChConfig->ptrHwBase->FILTER_CTL |=
                                (1uL << MSCLP_FILTER_CTL_FILTER_MODE_Pos);
                }
                else
                {
                    capsense_state_timeout = 0;
                    capsense_state = ALR_MODE;

                    /* Configure the MSCLP wake up timer as per the ALR mode refresh rate */
                    Cy_CapSense_ConfigureMsclpTimer(ALR_MODE_TIMER, &cy_capsense_context);

                    /* Enabling CIC2 filters for ALR mode sensors */
                    cy_capsense_context.ptrCommonConfig->ptrChConfig->ptrHwBase->FILTER_CTL |=
                                (1uL << MSCLP_FILTER_CTL_FILTER_MODE_Pos);
                }

                break;
                /* End of "WAKE_ON_TOUCH_MODE" */

            default:
                /**  Unknown power mode state. Unexpected situation.  **/
                CY_ASSERT(CY_ASSERT_FAILED);
                break;

        }
    }
}

/*******************************************************************************
* Function Name: initialize_capsense
********************************************************************************
* Summary:
*  This function initializes the CAPSENSE and configures the CAPSENSE
*  interrupt.
*
*******************************************************************************/
static void initialize_capsense(void)
{
    cy_capsense_status_t status = CY_CAPSENSE_STATUS_SUCCESS;

    /* CapSense interrupt configuration MSCLP 0 */
    const cy_stc_sysint_t capsense_msc0_interrupt_config =
    {
        .intrSrc = CY_MSCLP0_LP_IRQ,
        .intrPriority = CAPSENSE_MSC0_INTR_PRIORITY,
    };

    /* Capture the MSC HW block and initialize it to the default state. */
    status = Cy_CapSense_Init(&cy_capsense_context);

    if (CY_CAPSENSE_STATUS_SUCCESS == status)
    {
        /* Initialize CAPSENSE interrupt for MSC 0 */
        Cy_SysInt_Init(&capsense_msc0_interrupt_config, capsense_msc0_isr);
        NVIC_ClearPendingIRQ(capsense_msc0_interrupt_config.intrSrc);
        NVIC_EnableIRQ(capsense_msc0_interrupt_config.intrSrc);

        /* Setting calibration percentage to 70 */
        Cy_CapSense_SetCalibrationTarget(70u, CY_CAPSENSE_CSD_GROUP, &cy_capsense_context);

        status = Cy_CapSense_Enable(&cy_capsense_context);

        /* CIC2 filter is not applied for Low power widgets. Refer errata in
         * PSoC 4000T Datasheet for more details.
         * Disabling CIC2 filter to auto-calibrate low power sensors */
        cy_capsense_context.ptrCommonConfig->ptrChConfig->ptrHwBase->FILTER_CTL &=
                    ~(1uL << MSCLP_FILTER_CTL_FILTER_MODE_Pos);
        /* Set Maximum rawcount for low power widget calibration with CIC1 filter */
        CY_CAPSENSE_LOWPOWER0_MAX_RAW_COUNT_VALUE =
                    CY_CAPSENSE_LOWPOWER0_SNS_CLK_VALUE * CY_CAPSENSE_LOWPOWER0_NUM_SUBCONVERSIONS_VALUE;

        /* Calibrate all the low power widgets */
        Cy_CapSense_CalibrateAllLpSlots(&cy_capsense_context);

        /* Sets CIC2 mode for active widgets  only */
        if (WOT_MODE != capsense_state)
        {
            cy_capsense_context.ptrCommonConfig->ptrChConfig->ptrHwBase->FILTER_CTL |=
                        (1uL << MSCLP_FILTER_CTL_FILTER_MODE_Pos);
        }
    }

    if(status != CY_CAPSENSE_STATUS_SUCCESS)
    {
        /* This status could fail before tuning the sensors correctly.
         * Ensure that this function passes after the CAPSENSE sensors are tuned
         * as per procedure give in the Readme.md file */
    }
}

/*******************************************************************************
* Function Name: capsense_msc0_isr
********************************************************************************
* Summary:
*  Wrapper function for handling interrupts from CapSense MSC0 block.
*
*******************************************************************************/
static void capsense_msc0_isr(void)
{
    Cy_CapSense_InterruptHandler(CY_MSCLP0_HW, &cy_capsense_context);
}

#if ENABLE_EZI2C
/*******************************************************************************
* Function Name: initialize_capsense_tuner
********************************************************************************
* Summary:
*  EZI2C module to communicate with the CAPSENSE Tuner tool.
*
*******************************************************************************/
static void initialize_capsense_tuner(void)
{
    cy_en_scb_ezi2c_status_t status = CY_SCB_EZI2C_SUCCESS;

    /* EZI2C interrupt configuration structure */
    const cy_stc_sysint_t ezi2c_intr_config =
    {
        .intrSrc = CYBSP_EZI2C_IRQ,
        .intrPriority = EZI2C_INTR_PRIORITY,
    };

    /* Initialize the EzI2C firmware module */
    status = Cy_SCB_EZI2C_Init(CYBSP_EZI2C_HW, &CYBSP_EZI2C_config, &ezi2c_context);

    if(status != CY_SCB_EZI2C_SUCCESS)
    {
        CY_ASSERT(CY_ASSERT_FAILED);
    }

    Cy_SysInt_Init(&ezi2c_intr_config, ezi2c_isr);
    NVIC_EnableIRQ(ezi2c_intr_config.intrSrc);

    /* Set the CAPSENSE data structure as the I2C buffer to be exposed to the
     * master on primary slave address interface. Any I2C host tools such as
     * the Tuner or the Bridge Control Panel can read this buffer but you can
     * connect only one tool at a time.
     */
    Cy_SCB_EZI2C_SetBuffer1(CYBSP_EZI2C_HW, (uint8_t *)&cy_capsense_tuner,
                            sizeof(cy_capsense_tuner), sizeof(cy_capsense_tuner),
                            &ezi2c_context);

    Cy_SCB_EZI2C_Enable(CYBSP_EZI2C_HW);
}

/*******************************************************************************
* Function Name: ezi2c_isr
********************************************************************************
* Summary:
*  Wrapper function for handling interrupts from EZI2C block.
*
*******************************************************************************/
static void ezi2c_isr(void)
{
    Cy_SCB_EZI2C_Interrupt(CYBSP_EZI2C_HW, &ezi2c_context);
}

